Repository: SumPositive/AZCalc
Catalog: Demo/AZCalcDemo/Localizable.xcstrings
Source language: ja
Languages: en

# app.tab.calculator
source: 計算機
en: Calc

# app.tab.format
source: 書式
en: Format

# app.tab.rounding
source: 丸め
en: Round

# common.decimalDigits.value %lld
source: 小数桁数: %lld
en: Decimals: %lld

# common.input.section
source: 入力
en: Input

# common.number.placeholder
source: 数値
en: Number

# common.result.section
source: 結果
en: Result

# format.decimal.separator.label
source: 小数点記号
en: Decimal mark

# format.grouping.fours
source: 4桁 (1234,5678)
en: 4 digits (1234,5678)

# format.grouping.indian
source: インド式 (12,34,567)
en: Indian (12,34,567)

# format.grouping.none
source: なし
en: None

# format.grouping.section
source: 桁区切り
en: Grouping

# format.grouping.separator.label
source: 桁区切り記号
en: Group mark

# format.grouping.threes
source: 3桁 (1,234,567)
en: 3 digits (1,234,567)

# format.grouping.type.label
source: 区切りタイプ
en: Grouping

# format.trailingZeros.label
source: 末尾ゼロ補充
en: Pad zeros

# formula.error.invalidExpression
source: 無効な式
en: Not valid

# formula.error.missingOperand
source: オペランド不足
en: Missing operand

# formula.error.negativeSqrt
source: 負の数の平方根
en: Negative sqrt

# formula.error.overflow
source: オーバーフロー
en: Overflow

# formula.error.tooLong
source: 式が長すぎます（200文字以内）
en: Too long (200 max)

# formula.error.unmatchedParenthesis
source: 括弧の不一致
en: Unmatched ( )

# formula.error.zeroDivision
source: ゼロ除算
en: Divide by zero

# formula.example.addPercent
source: 5%増し
en: Add 5%

# formula.example.complex
source: 複合式
en: Mixed expression

# formula.example.cubeRoot
source: 立方根
en: Cube root

# formula.example.divideByPercent
source: 5%での除算
en: Divide by 5%

# formula.example.negate
source: 符号反転
en: Negate

# formula.example.nonTerminating
source: 割り切れない
en: Repeats

# formula.example.parentheses
source: 括弧
en: Parentheses

# formula.example.percentOf
source: 100の5%
en: 5% of 100

# formula.example.squareRoot
source: 平方根
en: Square root

# formula.example.subtractPercent
source: 5%引き
en: Minus 5%

# formula.examples.section
source: 使用例（タップで入力）
en: Examples

# formula.input.placeholder
source: 例: 100+5%
en: e.g. 100+5%

# formula.input.section
source: 式
en: Formula

# rounding.comparison.title
source: 丸めモード比較
en: Modes

# rounding.keepFull.footer
source: 全桁保持（keepFull）は桁制限なしで生の値を返します。
en: keepFull keeps the raw value at full precision.

# rounding.mode.keepFull.description
source: 丸めなし（生の値を返す）
en: No rounding (raw value)

# rounding.mode.keepFull.option
source: 全桁保持 (keepFull)
en: Keep full (keepFull)

# rounding.mode.keepFull.title
source: 全桁保持
en: Keep full

# rounding.mode.r54.description
source: JIS Z 8401 規則B
en: JIS Z 8401 Rule B

# rounding.mode.r54.option
source: 四捨五入 (r54)
en: Half up (r54)

# rounding.mode.r54.title
source: 四捨五入
en: Half up

# rounding.mode.r55.description
source: JIS Z 8401 規則A（偶数丸め）
en: JIS Z 8401 Rule A (even)

# rounding.mode.r55.option
source: 五捨五超入 (r55)
en: Half even (r55)

# rounding.mode.r55.title
source: 五捨五超入
en: Half even

# rounding.mode.r65.description
source: 5は切り捨て・6以上は切り上げ
en: 5 down, 6 up

# rounding.mode.r65.option
source: 五捨六入 (r65)
en: Half down (r65)

# rounding.mode.r65.title
source: 五捨六入
en: Half down

# rounding.mode.rMinus.description
source: 負の無限大方向に丸める
en: Toward -∞

# rounding.mode.rMinus.option
source: 負方向 (rMinus)
en: -∞ (rMinus)

# rounding.mode.rPlus.description
source: 正の無限大方向に丸める
en: Toward +∞

# rounding.mode.rPlus.option
source: 正方向 (rPlus)
en: +∞ (rPlus)

# rounding.mode.rup.description
source: 絶対値方向に丸める
en: Away from zero

# rounding.mode.rup.option
source: 切り上げ (rup)
en: Up (rup)

# rounding.mode.rup.title
source: 切り上げ
en: Up

# rounding.mode.truncateToDigits.description
source: 設定桁数で切り捨てる
en: Truncate to the set digits

# rounding.mode.truncateToDigits.option
source: 切り捨て (truncateToDigits)
en: Truncate (truncateToDigits)

# rounding.mode.truncateToDigits.title
source: 桁数で切り捨て
en: Truncate

# rounding.section
source: 丸め
en: Rounding

# rounding.type.label
source: 丸めタイプ
en: Mode

# settings.title
source: 設定
en: Settings
